Autodesk.Revit.DB.Workset.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new workset.
document:
The document in which the new instance is created.
name:
The workset name.
Returns:
Returns the newly created workset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a workshared document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given workset name is already in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015 Subscription Update